{"class_name": "Functional", "config": {"name": "model", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null], "dtype": "string", "sparse": false, "ragged": false, "name": "img_path"}, "registered_name": null, "name": "img_path", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "Lambda", "config": {"name": "lambda", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAkAAAATAAAA85AAAACXAHQBAAAAAAAAAAAAAGoBAAAAAAAAAAB0BAAAAAAA\nAAAAAAB8AHQBAAAAAAAAAAAAAGoDAAAAAAAAAAB0CAAAAAAAAAAAAAB0CAAAAAAAAAAAAABkAWYD\ndAAAAAAAAAAAAAAAagUAAAAAAAAAAKwCpgIAAKsCAAAAAAAAAACsA6YDAACrAwAAAAAAAAAAUwCp\nBE7pAwAAAKkC2gVzaGFwZdoFZHR5cGUpAdoTZm5fb3V0cHV0X3NpZ25hdHVyZakG2gJ0ZtoGbWFw\nX2Zu2iNsb2FkX2FuZF9wcmVwcm9jZXNzX2ltYWdlX2Zyb21fcGF0aNoKVGVuc29yU3BlY9oISU1H\nX1NJWkXaB2Zsb2F0MzKpAdoFcGF0aHNzAQAAACD6GS9hcHAvc3JjL21vZGVscy9tb2RlbHMucHna\nGWxvYWRfYW5kX3ByZXByb2Nlc3NfYmF0Y2j6NWJ1aWxkX21lcmdlZF9tb2RlbC48bG9jYWxzPi5s\nb2FkX2FuZF9wcmVwcm9jZXNzX2JhdGNo2AAAAPM+AAAAgADdDxGMed0ML9gMEd0gIqQNtVi9eMgR\n0DRL1VNV1FNd0CBe0SBe1CBe8AcEEArxAAQQCvQABBAK8AAECQrzAAAAAA==\n", null, null], "function_type": "lambda", "module": "src.models.models", "output_shape": [500, 500, 3], "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "registered_name": null, "build_config": {"input_shape": [null]}, "name": "lambda", "inbound_nodes": [[["img_path", 0, 0, {}]]]}, {"module": "tf_keras.src.engine.functional", "class_name": "Functional", "config": {"name": "efficientnetb1", "trainable": false, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 500, 500, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "registered_name": null, "name": "input_1", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "Rescaling", "config": {"name": "rescaling", "trainable": false, "dtype": "float32", "scale": 0.00392156862745098, "offset": 0.0}, "registered_name": null, "build_config": {"input_shape": [null, 500, 500, 3]}, "name": "rescaling", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Normalization", "config": {"name": "normalization", "trainable": false, "dtype": "float32", "axis": [3], "invert": false, "mean": null, "variance": null}, "registered_name": null, "build_config": {"input_shape": [null, 500, 500, 3]}, "name": "normalization", "inbound_nodes": [[["rescaling", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "ZeroPadding2D", "config": {"name": "stem_conv_pad", "trainable": false, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 500, 500, 3]}, "name": "stem_conv_pad", "inbound_nodes": [[["normalization", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "stem_conv", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 501, 501, 3]}, "name": "stem_conv", "inbound_nodes": [[["stem_conv_pad", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "stem_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 250, 250, 32]}, "name": "stem_bn", "inbound_nodes": [[["stem_conv", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "stem_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "registered_name": null, "build_config": {"input_shape": [null, 250, 250, 32]}, "name": "stem_activation", "inbound_nodes": [[["stem_bn", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "DepthwiseConv2D", "config": {"name": "block1a_dwconv", "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "depthwise_regularizer": null, "depthwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 250, 250, 32]}, "name": "block1a_dwconv", "inbound_nodes": [[["stem_activation", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "block1a_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 250, 250, 32]}, "name": "block1a_bn", "inbound_nodes": [[["block1a_dwconv", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "block1a_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "registered_name": null, "build_config": {"input_shape": [null, 250, 250, 32]}, "name": "block1a_activation", "inbound_nodes": [[["block1a_bn", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "GlobalAveragePooling2D", "config": {"name": "block1a_se_squeeze", "trainable": false, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "registered_name": null, "build_config": {"input_shape": [null, 250, 250, 32]}, "name": "block1a_se_squeeze", "inbound_nodes": [[["block1a_activation", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Reshape", "config": {"name": "block1a_se_reshape", "trainable": false, "dtype": "float32", "target_shape": [1, 1, 32]}, "registered_name": null, "build_config": {"input_shape": [null, 32]}, "name": "block1a_se_reshape", "inbound_nodes": [[["block1a_se_squeeze", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "block1a_se_reduce", "trainable": false, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "swish", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 1, 1, 32]}, "name": "block1a_se_reduce", "inbound_nodes": [[["block1a_se_reshape", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "block1a_se_expand", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 1, 1, 8]}, "name": "block1a_se_expand", "inbound_nodes": [[["block1a_se_reduce", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Multiply", "config": {"name": "block1a_se_excite", "trainable": false, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, 250, 250, 32], [null, 1, 1, 32]]}, "name": "block1a_se_excite", "inbound_nodes": [[["block1a_activation", 0, 0, {}], ["block1a_se_expand", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "block1a_project_conv", "trainable": false, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 250, 250, 32]}, "name": "block1a_project_conv", "inbound_nodes": [[["block1a_se_excite", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "block1a_project_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 250, 250, 16]}, "name": "block1a_project_bn", "inbound_nodes": [[["block1a_project_conv", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "DepthwiseConv2D", "config": {"name": "block1b_dwconv", "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "depthwise_regularizer": null, "depthwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 250, 250, 16]}, "name": "block1b_dwconv", "inbound_nodes": [[["block1a_project_bn", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "block1b_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 250, 250, 16]}, "name": "block1b_bn", "inbound_nodes": [[["block1b_dwconv", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "block1b_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "registered_name": null, "build_config": {"input_shape": [null, 250, 250, 16]}, "name": "block1b_activation", "inbound_nodes": [[["block1b_bn", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "GlobalAveragePooling2D", "config": {"name": "block1b_se_squeeze", "trainable": false, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "registered_name": null, "build_config": {"input_shape": [null, 250, 250, 16]}, "name": "block1b_se_squeeze", "inbound_nodes": [[["block1b_activation", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Reshape", "config": {"name": "block1b_se_reshape", "trainable": false, "dtype": "float32", "target_shape": [1, 1, 16]}, "registered_name": null, "build_config": {"input_shape": [null, 16]}, "name": "block1b_se_reshape", "inbound_nodes": [[["block1b_se_squeeze", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "block1b_se_reduce", "trainable": false, "dtype": "float32", "filters": 4, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "swish", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 1, 1, 16]}, "name": "block1b_se_reduce", "inbound_nodes": [[["block1b_se_reshape", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "block1b_se_expand", "trainable": false, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 1, 1, 4]}, "name": "block1b_se_expand", "inbound_nodes": [[["block1b_se_reduce", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Multiply", "config": {"name": "block1b_se_excite", "trainable": false, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, 250, 250, 16], [null, 1, 1, 16]]}, "name": "block1b_se_excite", "inbound_nodes": [[["block1b_activation", 0, 0, {}], ["block1b_se_expand", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "block1b_project_conv", "trainable": false, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 250, 250, 16]}, "name": "block1b_project_conv", "inbound_nodes": [[["block1b_se_excite", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "block1b_project_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 250, 250, 16]}, "name": "block1b_project_bn", "inbound_nodes": [[["block1b_project_conv", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "block1b_drop", "trainable": false, "dtype": "float32", "rate": 0.008695652173913044, "noise_shape": [null, 1, 1, 1], "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 250, 250, 16]}, "name": "block1b_drop", "inbound_nodes": [[["block1b_project_bn", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "block1b_add", "trainable": false, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, 250, 250, 16], [null, 250, 250, 16]]}, "name": "block1b_add", "inbound_nodes": [[["block1b_drop", 0, 0, {}], ["block1a_project_bn", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "block2a_expand_conv", "trainable": false, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 250, 250, 16]}, "name": "block2a_expand_conv", "inbound_nodes": [[["block1b_add", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "block2a_expand_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 250, 250, 96]}, "name": "block2a_expand_bn", "inbound_nodes": [[["block2a_expand_conv", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "block2a_expand_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "registered_name": null, "build_config": {"input_shape": [null, 250, 250, 96]}, "name": "block2a_expand_activation", "inbound_nodes": [[["block2a_expand_bn", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "ZeroPadding2D", "config": {"name": "block2a_dwconv_pad", "trainable": false, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 250, 250, 96]}, "name": "block2a_dwconv_pad", "inbound_nodes": [[["block2a_expand_activation", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "DepthwiseConv2D", "config": {"name": "block2a_dwconv", "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "depthwise_regularizer": null, "depthwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 251, 251, 96]}, "name": "block2a_dwconv", "inbound_nodes": [[["block2a_dwconv_pad", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "block2a_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 125, 125, 96]}, "name": "block2a_bn", "inbound_nodes": [[["block2a_dwconv", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "block2a_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "registered_name": null, "build_config": {"input_shape": [null, 125, 125, 96]}, "name": "block2a_activation", "inbound_nodes": [[["block2a_bn", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "GlobalAveragePooling2D", "config": {"name": "block2a_se_squeeze", "trainable": false, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "registered_name": null, "build_config": {"input_shape": [null, 125, 125, 96]}, "name": "block2a_se_squeeze", "inbound_nodes": [[["block2a_activation", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Reshape", "config": {"name": "block2a_se_reshape", "trainable": false, "dtype": "float32", "target_shape": [1, 1, 96]}, "registered_name": null, "build_config": {"input_shape": [null, 96]}, "name": "block2a_se_reshape", "inbound_nodes": [[["block2a_se_squeeze", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "block2a_se_reduce", "trainable": false, "dtype": "float32", "filters": 4, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "swish", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 1, 1, 96]}, "name": "block2a_se_reduce", "inbound_nodes": [[["block2a_se_reshape", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "block2a_se_expand", "trainable": false, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 1, 1, 4]}, "name": "block2a_se_expand", "inbound_nodes": [[["block2a_se_reduce", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Multiply", "config": {"name": "block2a_se_excite", "trainable": false, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, 125, 125, 96], [null, 1, 1, 96]]}, "name": "block2a_se_excite", "inbound_nodes": [[["block2a_activation", 0, 0, {}], ["block2a_se_expand", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "block2a_project_conv", "trainable": false, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 125, 125, 96]}, "name": "block2a_project_conv", "inbound_nodes": [[["block2a_se_excite", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "block2a_project_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 125, 125, 24]}, "name": "block2a_project_bn", "inbound_nodes": [[["block2a_project_conv", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "block2b_expand_conv", "trainable": false, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 125, 125, 24]}, "name": "block2b_expand_conv", "inbound_nodes": [[["block2a_project_bn", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "block2b_expand_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 125, 125, 144]}, "name": "block2b_expand_bn", "inbound_nodes": [[["block2b_expand_conv", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "block2b_expand_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "registered_name": null, "build_config": {"input_shape": [null, 125, 125, 144]}, "name": "block2b_expand_activation", "inbound_nodes": [[["block2b_expand_bn", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "DepthwiseConv2D", "config": {"name": "block2b_dwconv", "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "depthwise_regularizer": null, "depthwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 125, 125, 144]}, "name": "block2b_dwconv", "inbound_nodes": [[["block2b_expand_activation", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "block2b_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 125, 125, 144]}, "name": "block2b_bn", "inbound_nodes": [[["block2b_dwconv", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "block2b_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "registered_name": null, "build_config": {"input_shape": [null, 125, 125, 144]}, "name": "block2b_activation", "inbound_nodes": [[["block2b_bn", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "GlobalAveragePooling2D", "config": {"name": "block2b_se_squeeze", "trainable": false, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "registered_name": null, "build_config": {"input_shape": [null, 125, 125, 144]}, "name": "block2b_se_squeeze", "inbound_nodes": [[["block2b_activation", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Reshape", "config": {"name": "block2b_se_reshape", "trainable": false, "dtype": "float32", "target_shape": [1, 1, 144]}, "registered_name": null, "build_config": {"input_shape": [null, 144]}, "name": "block2b_se_reshape", "inbound_nodes": [[["block2b_se_squeeze", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "block2b_se_reduce", "trainable": false, "dtype": "float32", "filters": 6, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "swish", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 1, 1, 144]}, "name": "block2b_se_reduce", "inbound_nodes": [[["block2b_se_reshape", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "block2b_se_expand", "trainable": false, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 1, 1, 6]}, "name": "block2b_se_expand", "inbound_nodes": [[["block2b_se_reduce", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Multiply", "config": {"name": "block2b_se_excite", "trainable": false, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, 125, 125, 144], [null, 1, 1, 144]]}, "name": "block2b_se_excite", "inbound_nodes": [[["block2b_activation", 0, 0, {}], ["block2b_se_expand", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "block2b_project_conv", "trainable": false, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 125, 125, 144]}, "name": "block2b_project_conv", "inbound_nodes": [[["block2b_se_excite", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "block2b_project_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 125, 125, 24]}, "name": "block2b_project_bn", "inbound_nodes": [[["block2b_project_conv", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "block2b_drop", "trainable": false, "dtype": "float32", "rate": 0.026086956521739136, "noise_shape": [null, 1, 1, 1], "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 125, 125, 24]}, "name": "block2b_drop", "inbound_nodes": [[["block2b_project_bn", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "block2b_add", "trainable": false, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, 125, 125, 24], [null, 125, 125, 24]]}, "name": "block2b_add", "inbound_nodes": [[["block2b_drop", 0, 0, {}], ["block2a_project_bn", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "block2c_expand_conv", "trainable": false, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 125, 125, 24]}, "name": "block2c_expand_conv", "inbound_nodes": [[["block2b_add", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "block2c_expand_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 125, 125, 144]}, "name": "block2c_expand_bn", "inbound_nodes": [[["block2c_expand_conv", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "block2c_expand_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "registered_name": null, "build_config": {"input_shape": [null, 125, 125, 144]}, "name": "block2c_expand_activation", "inbound_nodes": [[["block2c_expand_bn", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "DepthwiseConv2D", "config": {"name": "block2c_dwconv", "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "depthwise_regularizer": null, "depthwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 125, 125, 144]}, "name": "block2c_dwconv", "inbound_nodes": [[["block2c_expand_activation", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "block2c_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 125, 125, 144]}, "name": "block2c_bn", "inbound_nodes": [[["block2c_dwconv", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "block2c_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "registered_name": null, "build_config": {"input_shape": [null, 125, 125, 144]}, "name": "block2c_activation", "inbound_nodes": [[["block2c_bn", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "GlobalAveragePooling2D", "config": {"name": "block2c_se_squeeze", "trainable": false, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "registered_name": null, "build_config": {"input_shape": [null, 125, 125, 144]}, "name": "block2c_se_squeeze", "inbound_nodes": [[["block2c_activation", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Reshape", "config": {"name": "block2c_se_reshape", "trainable": false, "dtype": "float32", "target_shape": [1, 1, 144]}, "registered_name": null, "build_config": {"input_shape": [null, 144]}, "name": "block2c_se_reshape", "inbound_nodes": [[["block2c_se_squeeze", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "block2c_se_reduce", "trainable": false, "dtype": "float32", "filters": 6, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "swish", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 1, 1, 144]}, "name": "block2c_se_reduce", "inbound_nodes": [[["block2c_se_reshape", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "block2c_se_expand", "trainable": false, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 1, 1, 6]}, "name": "block2c_se_expand", "inbound_nodes": [[["block2c_se_reduce", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Multiply", "config": {"name": "block2c_se_excite", "trainable": false, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, 125, 125, 144], [null, 1, 1, 144]]}, "name": "block2c_se_excite", "inbound_nodes": [[["block2c_activation", 0, 0, {}], ["block2c_se_expand", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "block2c_project_conv", "trainable": false, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 125, 125, 144]}, "name": "block2c_project_conv", "inbound_nodes": [[["block2c_se_excite", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "block2c_project_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 125, 125, 24]}, "name": "block2c_project_bn", "inbound_nodes": [[["block2c_project_conv", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "block2c_drop", "trainable": false, "dtype": "float32", "rate": 0.034782608695652174, "noise_shape": [null, 1, 1, 1], "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 125, 125, 24]}, "name": "block2c_drop", "inbound_nodes": [[["block2c_project_bn", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "block2c_add", "trainable": false, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, 125, 125, 24], [null, 125, 125, 24]]}, "name": "block2c_add", "inbound_nodes": [[["block2c_drop", 0, 0, {}], ["block2b_add", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "block3a_expand_conv", "trainable": false, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last",